spec/vcr_cassettes/Account_settings_page/with_active_subscription/cancel_subscription.yml

--- 
http_interactions:
- request:
    method: get
    uri: https://dd9e07b6afb84b0e8e31fefc56126c6e:@api.recurly.com/v2/plans/annual
    body:
      encoding: US-ASCII
      string: ""
    headers:
      Accept:
      - application/xml
      User-Agent:
      - Recurly/2.1.5; ruby 1.9.3p194 (2012-04-20 revision 35410) [x86_64-linux]
      Accept-Language:
      - en-US,en;q=0.5
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - blackhole
      Date:
      - Wed, 31 Oct 2012 14:45:14 GMT
      Content-Type:
      - application/xml; charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - close
      Content-Language:
      - en-US
      Etag:
      - "\"75a013f5701a291821000c1a8b7e884e\""
      Cache-Control:
      - max-age=0, private, must-revalidate
      X-Runtime:
      - "0.034054"
      Strict-Transport-Security:
      - max-age=15768000
    body:
      encoding: US-ASCII
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <plan href="https://api.recurly.com/v2/plans/annual">
          <add_ons href="https://api.recurly.com/v2/plans/annual/add_ons"/>
          <plan_code>annual</plan_code>
          <name>Activecell Annual</name>
          <description nil="nil"></description>
          <success_url nil="nil"></success_url>
          <cancel_url nil="nil"></cancel_url>
          <display_donation_amounts type="boolean">false</display_donation_amounts>
          <display_quantity type="boolean">false</display_quantity>
          <display_phone_number type="boolean">false</display_phone_number>
          <bypass_hosted_confirmation type="boolean">false</bypass_hosted_confirmation>
          <unit_name>unit</unit_name>
          <payment_page_tos_link nil="nil"></payment_page_tos_link>
          <plan_interval_length type="integer">12</plan_interval_length>
          <plan_interval_unit>months</plan_interval_unit>
          <trial_interval_length type="integer">0</trial_interval_length>
          <trial_interval_unit>days</trial_interval_unit>
          <total_billing_cycles nil="nil"></total_billing_cycles>
          <accounting_code nil="nil"></accounting_code>
          <created_at type="datetime">2012-05-25T20:37:43Z</created_at>
          <unit_amount_in_cents>
            <USD type="integer">59988</USD>
          </unit_amount_in_cents>
          <setup_fee_in_cents>
            <USD type="integer">0</USD>
          </setup_fee_in_cents>
        </plan>
    http_version:
  recorded_at: Wed, 31 Oct 2012 14:45:14 GMT
- request: 
    method: get
    uri: https://dd9e07b6afb84b0e8e31fefc56126c6e:@api.recurly.com/v2/subscriptions/dummy-subscription-uuid
    body:
      encoding: US-ASCII
      string: ""
    headers:
      Accept:
      - application/xml
      User-Agent:
      - Recurly/2.1.5; ruby 1.9.3p194 (2012-04-20 revision 35410) [x86_64-linux]
      Accept-Language:
      - en-US,en;q=0.5
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - blackhole
      Date:
      - Wed, 31 Oct 2012 15:53:39 GMT
      Content-Type:
      - application/xml; charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - close
      Content-Language:
      - en-US
      Etag:
      - "\"790e6f87cd1d3f0ed1aeaca53f4dcb8b\""
      Cache-Control:
      - max-age=0, private, must-revalidate
      X-Runtime:
      - "0.038457"
      Strict-Transport-Security:
      - max-age=15768000
    body:
      encoding: US-ASCII
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <subscription href="https://api.recurly.com/v2/subscriptions/dummy-subscription-uuid">
          <account href="https://api.recurly.com/v2/accounts/507d23ed76368bdf2d000002@recurly"/>
          <plan href="https://api.recurly.com/v2/plans/annual">
            <plan_code>annual</plan_code>
            <name>Activecell Annual</name>
          </plan>
          <uuid>dummy-subscription-uuid</uuid>
          <state>active</state>
          <unit_amount_in_cents type="integer">59988</unit_amount_in_cents>
          <currency>USD</currency>
          <quantity type="integer">1</quantity>
          <activated_at type="datetime">2012-10-31T14:27:11Z</activated_at>
          <canceled_at nil="nil"></canceled_at>
          <expires_at nil="nil"></expires_at>
          <total_billing_cycles nil="nil"></total_billing_cycles>
          <remaining_billing_cycles nil="nil"></remaining_billing_cycles>
          <current_period_started_at type="datetime">2012-10-31T14:45:12Z</current_period_started_at>
          <current_period_ends_at type="datetime">2013-10-31T14:45:12Z</current_period_ends_at>
          <trial_started_at nil="nil"></trial_started_at>
          <trial_ends_at nil="nil"></trial_ends_at>
          <subscription_add_ons type="array">
          </subscription_add_ons>
          <a name="cancel" href="https://api.recurly.com/v2/subscriptions/dummy-subscription-uuid/cancel" method="put"/>
          <a name="terminate" href="https://api.recurly.com/v2/subscriptions/dummy-subscription-uuid/terminate" method="put"/>
          <a name="postpone" href="https://api.recurly.com/v2/subscriptions/dummy-subscription-uuid/postpone" method="put"/>
        </subscription>

    http_version:
  recorded_at: Wed, 31 Oct 2012 15:53:39 GMT
- request:
    method: put
    uri: https://dd9e07b6afb84b0e8e31fefc56126c6e:@api.recurly.com/v2/subscriptions/dummy-subscription-uuid/terminate?refund=full
    body:
      encoding: US-ASCII
      string: ""
    headers:
      Accept:
      - application/xml
      User-Agent:
      - Recurly/2.1.5; ruby 1.9.3p194 (2012-04-20 revision 35410) [x86_64-linux]
      Accept-Language:
      - en-US,en;q=0.5
      Content-Type:
      - application/xml
  response:
    status:
      code: 400
      message: Bad Request
    headers:
      Server:
      - blackhole
      Date:
      - Wed, 31 Oct 2012 15:53:40 GMT
      Content-Type:
      - application/xml; charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - close
      Content-Language:
      - en-US
      Cache-Control:
      - no-cache
      X-Runtime:
      - "0.037870"
    body:
      encoding: US-ASCII
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <error>
          <symbol>invalid_transaction</symbol>
          <description>An error occurred while refunding your transaction. Please contact support.</description>
        </error>

    http_version:
  recorded_at: Wed, 31 Oct 2012 15:53:40 GMT
- request:
    method: put
    uri: https://dd9e07b6afb84b0e8e31fefc56126c6e:@api.recurly.com/v2/subscriptions/dummy-subscription-uuid/terminate?refund=none
    body:
      encoding: US-ASCII
      string: ""
    headers:
      Accept:
      - application/xml
      User-Agent:
      - Recurly/2.1.5; ruby 1.9.3p194 (2012-04-20 revision 35410) [x86_64-linux]
      Accept-Language:
      - en-US,en;q=0.5
      Content-Type:
      - application/xml
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - blackhole
      Date:
      - Wed, 31 Oct 2012 15:53:41 GMT
      Content-Type:
      - application/xml; charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - close
      Content-Language:
      - en-US
      Etag:
      - "\"32907a3ab16e1493cd5e28cd899ceb16\""
      Location:
      - https://api.recurly.com/v2/subscriptions/dummy-subscription-uuid
      Cache-Control:
      - max-age=0, private, must-revalidate
      X-Runtime:
      - "0.213010"
      Strict-Transport-Security:
      - max-age=15768000
    body:
      encoding: US-ASCII
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <subscription href="https://api.recurly.com/v2/subscriptions/dummy-subscription-uuid">
          <account href="https://api.recurly.com/v2/accounts/507d23ed76368bdf2d000002@recurly"/>
          <plan href="https://api.recurly.com/v2/plans/annual">
            <plan_code>annual</plan_code>
            <name>Activecell Annual</name>
          </plan>
          <uuid>dummy-subscription-uuid</uuid>
          <state>expired</state>
          <unit_amount_in_cents type="integer">59988</unit_amount_in_cents>
          <currency>USD</currency>
          <quantity type="integer">1</quantity>
          <activated_at type="datetime">2012-10-31T14:27:11Z</activated_at>
          <canceled_at type="datetime">2012-10-31T15:53:41Z</canceled_at>
          <expires_at type="datetime">2012-10-31T15:53:41Z</expires_at>
          <total_billing_cycles nil="nil"></total_billing_cycles>
          <remaining_billing_cycles nil="nil"></remaining_billing_cycles>
          <current_period_started_at type="datetime">2012-10-31T14:45:12Z</current_period_started_at>
          <current_period_ends_at type="datetime">2013-10-31T14:45:12Z</current_period_ends_at>
          <trial_started_at nil="nil"></trial_started_at>
          <trial_ends_at nil="nil"></trial_ends_at>
          <subscription_add_ons type="array">
          </subscription_add_ons>
        </subscription>

    http_version:
  recorded_at: Wed, 31 Oct 2012 15:53:42 GMT
recorded_with: VCR 2.2.5
