spec/vcr_cassettes/RecurlySubscriber/_terminate_subscription/when_the_subscription_can_be_found.yml

--- 
http_interactions: 
- request: 
    method: post
    uri: https://dd9e07b6afb84b0e8e31fefc56126c6e:@api.recurly.com/v2/subscriptions
    body: 
      encoding: US-ASCII
      string: <subscription><account><account_code>account-to-terminate-code</account_code><billing_info><month>1</month><number>4111-1111-1111-1111</number><year>2014</year></billing_info><email>user@example.com</email><first_name>Admin</first_name><last_name>Adminowski</last_name></account><currency>USD</currency><plan_code>annual</plan_code></subscription>
    headers: 
      Accept: 
      - application/xml
      User-Agent: 
      - Recurly/2.1.5; ruby 1.9.3p194 (2012-04-20 revision 35410) [x86_64-linux]
      Content-Type: 
      - application/xml
  response: 
    status: 
      code: 201
      message: Created
    headers: 
      Server: 
      - blackhole
      Date: 
      - Sat, 29 Sep 2012 18:13:57 GMT
      Content-Type: 
      - application/xml; charset=utf-8
      Transfer-Encoding: 
      - chunked
      Connection: 
      - close
      Content-Language: 
      - en-US
      Etag: 
      - "\"89ce6bb9d370865b9e36a1fc1bbae631\""
      Location: 
      - https://api.recurly.com/v2/subscriptions/1b82075c071031226b7f36445d8d4c1f
      Cache-Control: 
      - max-age=0, private, must-revalidate
      X-Runtime: 
      - "0.352217"
    body: 
      encoding: US-ASCII
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <subscription href="https://api.recurly.com/v2/subscriptions/1b82075c071031226b7f36445d8d4c1f">
          <account href="https://api.recurly.com/v2/accounts/account-to-terminate-code"/>
          <plan href="https://api.recurly.com/v2/plans/annual">
            <plan_code>annual</plan_code>
            <name>Activecell Annual</name>
          </plan>
          <uuid>1b82075c071031226b7f36445d8d4c1f</uuid>
          <state>active</state>
          <unit_amount_in_cents type="integer">59988</unit_amount_in_cents>
          <currency>USD</currency>
          <quantity type="integer">1</quantity>
          <activated_at type="datetime">2012-09-29T18:13:57Z</activated_at>
          <canceled_at nil="nil"></canceled_at>
          <expires_at nil="nil"></expires_at>
          <total_billing_cycles nil="nil"></total_billing_cycles>
          <remaining_billing_cycles nil="nil"></remaining_billing_cycles>
          <current_period_started_at type="datetime">2012-09-29T18:13:57Z</current_period_started_at>
          <current_period_ends_at type="datetime">2012-10-29T18:13:57Z</current_period_ends_at>
          <trial_started_at type="datetime">2012-09-29T18:13:57Z</trial_started_at>
          <trial_ends_at type="datetime">2012-10-29T18:13:57Z</trial_ends_at>
          <subscription_add_ons type="array">
          </subscription_add_ons>
          <a name="cancel" href="https://api.recurly.com/v2/subscriptions/1b82075c071031226b7f36445d8d4c1f/cancel" method="put"/>
          <a name="terminate" href="https://api.recurly.com/v2/subscriptions/1b82075c071031226b7f36445d8d4c1f/terminate" method="put"/>
          <a name="postpone" href="https://api.recurly.com/v2/subscriptions/1b82075c071031226b7f36445d8d4c1f/postpone" method="put"/>
        </subscription>

    http_version: 
  recorded_at: Sat, 29 Sep 2012 18:13:58 GMT
- request: 
    method: get
    uri: https://dd9e07b6afb84b0e8e31fefc56126c6e:@api.recurly.com/v2/plans/annual
    body: 
      encoding: US-ASCII
      string: ""
    headers: 
      Accept: 
      - application/xml
      User-Agent: 
      - Recurly/2.1.5; ruby 1.9.3p194 (2012-04-20 revision 35410) [x86_64-linux]
  response: 
    status: 
      code: 200
      message: OK
    headers: 
      Server: 
      - blackhole
      Date: 
      - Sat, 29 Sep 2012 18:13:58 GMT
      Content-Type: 
      - application/xml; charset=utf-8
      Transfer-Encoding: 
      - chunked
      Connection: 
      - close
      Content-Language: 
      - en-US
      Etag: 
      - "\"5cf4d812bf82b7faefde0184266258b7\""
      Cache-Control: 
      - max-age=0, private, must-revalidate
      X-Runtime: 
      - "0.026064"
      Strict-Transport-Security: 
      - max-age=15768000
    body: 
      encoding: US-ASCII
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <plan href="https://api.recurly.com/v2/plans/annual">
          <add_ons href="https://api.recurly.com/v2/plans/annual/add_ons"/>
          <plan_code>annual</plan_code>
          <name>Activecell Annual</name>
          <description nil="nil"></description>
          <success_url nil="nil"></success_url>
          <cancel_url nil="nil"></cancel_url>
          <display_donation_amounts type="boolean">false</display_donation_amounts>
          <display_quantity type="boolean">false</display_quantity>
          <display_phone_number type="boolean">false</display_phone_number>
          <bypass_hosted_confirmation type="boolean">false</bypass_hosted_confirmation>
          <unit_name>unit</unit_name>
          <payment_page_tos_link nil="nil"></payment_page_tos_link>
          <plan_interval_length type="integer">12</plan_interval_length>
          <plan_interval_unit>months</plan_interval_unit>
          <trial_interval_length type="integer">0</trial_interval_length>
          <trial_interval_unit>days</trial_interval_unit>
          <total_billing_cycles nil="nil"></total_billing_cycles>
          <accounting_code nil="nil"></accounting_code>
          <created_at type="datetime">2012-05-25T20:37:43Z</created_at>
          <unit_amount_in_cents>
            <USD type="integer">59988</USD>
          </unit_amount_in_cents>
          <setup_fee_in_cents>
            <USD type="integer">0</USD>
          </setup_fee_in_cents>
        </plan>

    http_version: 
  recorded_at: Sat, 29 Sep 2012 18:13:59 GMT
- request: 
    method: put
    uri: https://dd9e07b6afb84b0e8e31fefc56126c6e:@api.recurly.com/v2/subscriptions/1b82075c071031226b7f36445d8d4c1f/terminate?refund=full
    body: 
      encoding: US-ASCII
      string: ""
    headers: 
      Accept: 
      - application/xml
      User-Agent: 
      - Recurly/2.1.5; ruby 1.9.3p194 (2012-04-20 revision 35410) [x86_64-linux]
      Content-Type: 
      - application/xml
  response: 
    status: 
      code: 400
      message: Bad Request
    headers: 
      Server: 
      - blackhole
      Date: 
      - Sat, 29 Sep 2012 18:13:59 GMT
      Content-Type: 
      - application/xml; charset=utf-8
      Transfer-Encoding: 
      - chunked
      Connection: 
      - close
      Content-Language: 
      - en-US
      Cache-Control: 
      - no-cache
      X-Runtime: 
      - "0.038925"
    body: 
      encoding: US-ASCII
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <error>
          <symbol>invalid_transaction</symbol>
          <description>The transaction cannot be refunded. Please contact support.</description>
        </error>

    http_version: 
  recorded_at: Sat, 29 Sep 2012 18:14:00 GMT
- request: 
    method: put
    uri: https://dd9e07b6afb84b0e8e31fefc56126c6e:@api.recurly.com/v2/subscriptions/1b82075c071031226b7f36445d8d4c1f/terminate?refund=none
    body: 
      encoding: US-ASCII
      string: ""
    headers: 
      Accept: 
      - application/xml
      User-Agent: 
      - Recurly/2.1.5; ruby 1.9.3p194 (2012-04-20 revision 35410) [x86_64-linux]
      Content-Type: 
      - application/xml
  response: 
    status: 
      code: 200
      message: OK
    headers: 
      Server: 
      - blackhole
      Date: 
      - Sat, 29 Sep 2012 18:14:01 GMT
      Content-Type: 
      - application/xml; charset=utf-8
      Transfer-Encoding: 
      - chunked
      Connection: 
      - close
      Content-Language: 
      - en-US
      Etag: 
      - "\"f2ec27b677da303ddbeae5c992c3c6e9\""
      Location: 
      - https://api.recurly.com/v2/subscriptions/1b82075c071031226b7f36445d8d4c1f
      Cache-Control: 
      - max-age=0, private, must-revalidate
      X-Runtime: 
      - "0.121952"
      Strict-Transport-Security: 
      - max-age=15768000
    body: 
      encoding: US-ASCII
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <subscription href="https://api.recurly.com/v2/subscriptions/1b82075c071031226b7f36445d8d4c1f">
          <account href="https://api.recurly.com/v2/accounts/account-to-terminate-code"/>
          <plan href="https://api.recurly.com/v2/plans/annual">
            <plan_code>annual</plan_code>
            <name>Activecell Annual</name>
          </plan>
          <uuid>1b82075c071031226b7f36445d8d4c1f</uuid>
          <state>expired</state>
          <unit_amount_in_cents type="integer">59988</unit_amount_in_cents>
          <currency>USD</currency>
          <quantity type="integer">1</quantity>
          <activated_at type="datetime">2012-09-29T18:13:57Z</activated_at>
          <canceled_at type="datetime">2012-09-29T18:14:00Z</canceled_at>
          <expires_at type="datetime">2012-09-29T18:14:00Z</expires_at>
          <total_billing_cycles nil="nil"></total_billing_cycles>
          <remaining_billing_cycles nil="nil"></remaining_billing_cycles>
          <current_period_started_at type="datetime">2012-09-29T18:13:57Z</current_period_started_at>
          <current_period_ends_at type="datetime">2012-10-29T18:13:57Z</current_period_ends_at>
          <trial_started_at type="datetime">2012-09-29T18:13:57Z</trial_started_at>
          <trial_ends_at type="datetime">2012-10-29T18:13:57Z</trial_ends_at>
          <subscription_add_ons type="array">
          </subscription_add_ons>
        </subscription>

    http_version: 
  recorded_at: Sat, 29 Sep 2012 18:14:01 GMT
recorded_with: VCR 2.2.5
